{
  "_name_or_path": "asahi417/tner-xlm-roberta-base-bc5cdr",
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-chemical",
    "1": "O",
    "2": "B-disease",
    "3": "I-disease",
    "4": "I-chemical"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-chemical": 0,
    "B-disease": 2,
    "I-chemical": 4,
    "I-disease": 3,
    "O": 1
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.3.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
