{"bos_token": "<s>", "eos_token": "</s>", "sep_token": "</s>", "cls_token": "<s>", "unk_token": "<unk>", "pad_token": "<pad>", "mask_token": {"content": "<mask>", "single_word": false, "lstrip": true, "rstrip": false, "normalized": true, "__type": "AddedToken"}, "model_max_length": 512, "name_or_path": "asahi417/tner-xlm-roberta-base-bc5cdr", "special_tokens_map_file": "/root/.cache/huggingface/transformers/d59be0bb47689ce53b31cea19550dfa37fdd443a6533f323f8cd17c670400e9d.0dc5b1041f62041ebbd23b1297f2f573769d5c97d8b7c28180ec86b8f6185aa8"}